planets_app/app/controllers/planets_controller.rb

  def index
    @planets = Planet.all
---
SELECT "planets".* FROM "planets"

    def get_planet
      @planet = Planet.find(params[:id])
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]