app/controllers/moons_controller.rb

  def index
    @moons = Moon.all
---
SELECT "moons".* FROM "moons"

  def random
    @moon = Moon.all.order("RANDOM()").first
---
SELECT  "moons".* FROM "moons" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]

  def get_moon
    @moon = Moon.find(params[:id])
---
SELECT  "moons".* FROM "moons" WHERE "moons"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]