app/controllers/planets_controller.rb

SELECT "planets".* FROM "planets"
---
  def index
    @planets = Planet.all

SELECT  "planets".* FROM "planets" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def random
    @planet = Planet.all.order("RANDOM()").first

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def get_planet
    @planet = Planet.find(params[:id])